# Pandas

Pandas is a open-source Python library. Pandas is used to analyze data.

In [1]:
import pandas as pd

- Series
- DataFrame
- Read data
- Analyze Data
- Clean data
- Clean Empty Cells
- Clean Wrong Format
- Clean Wrong Data
- Remove Duplicates
- Correlations

## Series

A Pandas Series is like a column in a table. It is a one-dimensional array holding data of any type. Series can be made from a simple list.

In [2]:
list_country = ['Indonesia', 'Malaysia', 'Singapore', 'China']
df = pd.Series(list_country)
df

0    Indonesia
1     Malaysia
2    Singapore
3        China
dtype: object

In [3]:
df[0]

'Indonesia'

With the index argument, we can name your own labels.

In [4]:
df = pd.Series(list_country, index = ['a', 'b', 'c', 'd'])
df

a    Indonesia
b     Malaysia
c    Singapore
d        China
dtype: object

In [5]:
df['c']

'Singapore'

We can also use a dictionary, when creating a Series.

In [6]:
dict_country = {'first':'Indonesia', 'second':'Malaysia', 'third':'Myanmar', 'fourth':'Timor Leste'}
df = pd.Series(dict_country)
df

first       Indonesia
second       Malaysia
third         Myanmar
fourth    Timor Leste
dtype: object

In [7]:
df['second']

'Malaysia'

# DataFrames
DataFrames in pandas are multi-dimensional tables with rows and columns. Series is like a column, while dataframes is a whole table

Create a dataframe from series:

In [2]:
series = {'name' : ['alex', 'charles', 'bernard', 'mahfoudz'],
          'height' : [170, 181, 165, 190],
          'weight' : [59, 73, 89, 78]}
df = pd.DataFrame(series)
df.head()

       name  height  weight
0      alex     170      59
1   charles     181      73
2   bernard     165      89
3  mahfoudz     190      78

## Locate row
Use previous dataframe, we can use `loc` to locate row

In [4]:
df.loc[0]

name      alex
height     170
weight      59
Name: 0, dtype: object

In [6]:
df.loc[[0,1]]

      name  height  weight
0     alex     170      59
1  charles     181      73

In [7]:
df_index = pd.DataFrame(series, index=['1st', '2nd', '3rd', '4th']) # Make dataframe with different index
df_index.head()

         name  height  weight
1st      alex     170      59
2nd   charles     181      73
3rd   bernard     165      89
4th  mahfoudz     190      78

In [8]:
df_index.loc[['1st','4th']]

         name  height  weight
1st      alex     170      59
4th  mahfoudz     190      78

It will return spesific row based on index


**Important Notes: When we use `[]` it will return pandas dataframe**

## Import files

We will import file .csv into a pandas dataframe, we will import Employee.csv

In [9]:
df = pd.read_csv('assets/dataset/Employee.csv')
df.head()

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
0,Bachelors,2017,Bangalore,3,34,Male,No,0,0
1,Bachelors,2013,Pune,1,28,Female,No,3,1
2,Bachelors,2014,New Delhi,3,38,Female,No,2,0
3,Masters,2016,Bangalore,3,27,Male,No,5,1
4,Masters,2017,Pune,3,24,Male,Yes,2,1

Pandas can import many type of files, open this [link](https://realpython.com/pandas-read-write-files/) for complete tutorial

## Cleaning data

Cleaning data is important step for build a machine learning model. There are many ways to clean a data, here are some examples:
1.  Handling missing data
2.  Find duplicates
3.  Outliers
4.  Check data types
5.  Standardize data
6.  Encoding categorical
7.  Scaling and normalization

There are many more steps if we use text data for NLP

# Numpy

# Matplotlib

# Reference
https://www.w3schools.com/python/pandas/default.asp